def f(n):
    sum = 0
    for i in range(1, n + 1):
        sum = sum + i
    return sum
# f = O(n)
def g(n):
    sum = 0
    for i in range(1, n + 1): #O(1) * n
        sum = sum + i + f(i) #O(n) * n
    return sum
# g = O(n²)
'''
Визначте асимптотичну оцінку виконання функції g(n) у найгіршому випадку в 
термінах 𝑂–«великого». 
Що є результатом виконання функції g(n) для 
заданого натурального числа 𝑛. 
(Сума всіх чисел від 1 до n) + (Сума сум всіх чисел від 1 до кожного числа від 1 до n)

Чи можна оптимізувати цю функцію, 
покращивши її асимптотичну оцінку
Так, можна оптимізувати до O(1)
'''
def g(n):
    sum = n(n+1)(n+5)/6
    return sum
