def f(n):
    sum = 0
    for i in range(1, n + 1):
        sum = sum + i
    return sum

#O(n)

def g(n):
    sum = 0
    for i in range(1, n + 1):
        sum = sum + i + f(i)
    return sum

#O(n^2)

def h(n):
    return f(n) + g(n)

# O(n^2 + n) = O(n^2)
'''
Визначте асимптотичну оцінку виконання функції h(n) у найгіршому випадку в 
термінах 𝑂–«великого». 
Що є результатом її виконання для заданого 
натурального числа 𝑛. 
2*(сума всіх чисел від 1 до n) + (сума сум всіх чисел від 1 до i, для і від 1 до n)
Чи можна оптимізувати цю функцію, покращивши її 
асимптотичну оцінку?
Так, до O(1)
'''

def h(n):
    return n(n+1)/2 + n(n+1)(n+5)/6
