"""
Припустимо, що 𝑛, 𝑚 та 𝑘 невід’ємні цілі числа і методи e, f, g та h мають
такі характеристики:
• Час виконання у найгіршому випадку методу e(n, m, k) є 𝑂(1) і
повертає значення з проміжку від 1 до (𝑛 + 𝑚 + 𝑘).
• Час виконання у найгіршому випадку методу f(n, m, k) є 𝑂(𝑛 + 𝑚).
• Час виконання у найгіршому випадку методу g(n, m, k) є 𝑂(𝑚 + 𝑘).
• Час виконання у найгіршому випадку методу h(n, m, k) є 𝑂(𝑛 + 𝑘).
Визначте асимптотичні оцінки виконання програм у найгіршому випадку в
термінах 𝑂–«великого» для фрагментів програм зазначених нижче:
"""
# a)
f(n, 10, 0)    #O(n+10)
g(n, m, k)   #O(m+k)
h(n, m, 1000000)   #O(n+1000000)
# O(n+m+k)


# b) 
for i in range(e(n, 10, 100)): # (n+110)*O(1)
    f(n, 10, 0); # (n+110)*O(n+10)
# (n+110)*(O(n)+1) = O(n^2)

# c) 
for i in range(n):
    f(n, m, k); 
# O(n+m) * n = O(n^2 + m*n)


# d)
for i in range(n):
    for j in range(i, n):
        f(n, m, k); # O(n+m) * (n*(n+1)/2)
# O(n*n*(n+1)/2 + m*n*(n+1)/2) = O(n^3 + mn^2)
